/*=========================================================
 *文件名称:  HandleBuss.h
 *创建日期：2017-1-15
 *修改记录：
 *  2017-1-15  
 *功能描述：处理业务
 ===========================================================*/
#ifndef __HANDLEBUSS_H_
#define __HANDLEBUSS_H_

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "Config.h"
#include "Cfifo.h"
#include "WriteLog.h"

#define MAXLEN 1024 
#define N      60 

typedef struct _scCodeFile
{
	char oneCol[7];
	char twoCol[8];
	char threeCol[7];
}scCodeFile;

char                     str_str[100];      //只共测试用的全局变量
/*=========================================================
 *函数入参: str传入函数中带有空格的字符串       
 *函数出参: 无
 *返回值:   成功返回去空格的字符串
 *功能说明: 去空格函数
 *===========================================================*/
char *str_trim(char *str);

/*=========================================================
 *函数入参:  buf 要截取的字符串            
 *函数出参:  无
 *返回值:    成功返回截取到的字符串，失败返回空
 *功能说明:  截取从576位开长度为8的一个子字符串
 *===========================================================*/
char* strstr_576_8(char buf[2048]);

/*=========================================================
 *函数入参:  buf 要截取的字符串              
 *函数出参:  无
 *返回值:    成功返回截取到的字符串，失败返回空
 *功能说明:  截取从49位开长度为7的一个子字符串
 *===========================================================*/
char* strstr_49_7(char buf[2048]);

/*=========================================================
 *函数入参: filename    要读的文件的名字                     
 *函数出参: dest        从文件中读到的内容放入到dest中
 *          maxlen      文件的字符长度
 *返回值:   成功返回从文件中读到字符长度，失败返回-1
 *功能说明: 扫描文件，将文件中的内容加载到内存中
 *===========================================================*/
int Readfile_Array(const char *filename, char *dest, int maxlen);

/*=========================================================
 *函数入参:filename文件的名字，buf从F5端接到的报文缓冲区              
 *函数出参: 无
 *返回值:   成功返回处理过的字符串，失败返回NULL
 *功能说明: 将配置文件中的数据读到结构体数组，并且处理银行端发过来的报文字符串
 *===========================================================*/
char* Readfile_StructArray_HandelBuf(char *filename, char* buf);

/*=========================================================
 *函数入参: buf要处理的字符串              
 *函数出参: 无
 *返回值:   成功返回0，失败返回-1
 *功能说明: 将上一步处理过的字符串和配置文件中的字符串相比较，如果
 						配置文件中有该字符串就将其发往老三方，否则就发往新三方
 *===========================================================*/
int seg_Handle_Buf(char *buf);

/*=========================================================
 *函数入参: srcstr   要处理的字符串
 *          pos      要截取的字符串开始的位置
 *          length   要截取的字符串的长度         
 *函数出参: 无
 *返回值:   成功返回截取到的字符串，失败返回NULL
 *功能说明: 从指定的位置截取一定长度的字符串
 *===========================================================*/
char* strstr_pos_length(char* srcstr, int pos, int length);

#endif


